{
    "The Weeknd": {
        "listeners": 3547248,
        "bio_summary": "Abel Makkonen Tesfaye, popularly known as The Weeknd (born February 16, 1990 in Toronto, Ontario, Canada), is a Canadian R&B/hip-hop musician, singer-songwriter and record producer. He chose his stage name in tribute to when he was 17 years old, when, along with his friend La Mar Taylor, he dropped out of high school, took his mattress, and \"left one weekend and never came home\". However, his estranged former producer Jeremy Rose claims the name was his idea. <a href=\"https://www.last.fm/music/The+Weeknd\">Read more on Last.fm</a>"
    },
    "Taylor Swift": {
        "listeners": 4263780,
        "bio_summary": "Taylor Alison Swift is an American singer-songwriter. Her discography spans multiple genres, and her narrative songwriting, which is often inspired by her personal life, has received widespread media coverage and critical praise.\n\nBorn in West Reading, Pennsylvania, Swift relocated to Nashville, Tennessee in 2004 to pursue a career in country music. She broke into the country music scene with her eponymous self-titled debut studio album, Taylor Swift in 2006, which included the singles \"Teardrops on My Guitar\" and \"Our Song\". <a href=\"https://www.last.fm/music/Taylor+Swift\">Read more on Last.fm</a>"
    },
    "Drake": {
        "listeners": 5194018,
        "bio_summary": "Aubrey Drake Graham (born October 24, 1986) is a Canadian rapper, singer, songwriter, record producer, actor, and businessman. Drake was an actor on the teen drama television series Degrassi: The Next Generation in the early 2000s. Intent on pursuing a career in music, he left the series in 2007 after releasing his debut mixtape, Room for Improvement. He released two further independent projects, Comeback Season and So Far Gone, before signing to Lil Wayne's Young Money Entertainment in June 2009. <a href=\"https://www.last.fm/music/Drake\">Read more on Last.fm</a>"
    },
    "Kanye West": {
        "listeners": 6239970,
        "bio_summary": "Ye (born Kanye Omari West on June 8, 1977, in Atlanta, Georgia), professionally known as Kanye West, is a Grammy award-winning American rapper, producer, singer, author, director, performance artist and fashion designer.\n\nWest began making beats and rapping in the early 90s in his hometown of Chicago, Illinois, when he formed the rap group Go Getters with Chicago natives GLC and Really Doe. He later gained nationwide popularity through his work in New York <a href=\"https://www.last.fm/music/Kanye+West\">Read more on Last.fm</a>"
    },
    "Lana Del Rey": {
        "listeners": 3680018,
        "bio_summary": "Elizabeth Woolridge Grant, known professionally as Lana Del Rey, is an American singer-songwriter and producer. Her music is noted for its cinematic quality and exploration of tragic romance, glamour, and melancholia, with frequent references to contemporary pop culture and 1950s–1960s Americana.\n\nRaised in upstate New York, Del Rey moved to New York City in 2005 to pursue a music career. After numerous projects, including her self-titled debut studio album <a href=\"https://www.last.fm/music/Lana+Del+Rey\">Read more on Last.fm</a>"
    },
    "Doja Cat": {
        "listeners": 2199357,
        "bio_summary": "Amala Zandile Dlamini (born October 21, 1995), known professionally as Doja Cat, is an American rapper, singer, songwriter, and producer based in Los Angeles. She is of South African descent. She starting making music on SoundCloud, where she uploaded her first song \"SO HIGH\" in 2012. She signed a recording contract with RCA Records in late 2013, later releasing her debut EP, Purrr!, the following year.\n\nDoja rose to prominence in 2018 with her single \"MOOO!\", which became a viral success on YouTube. <a href=\"https://www.last.fm/music/Doja+Cat\">Read more on Last.fm</a>"
    },
    "Kendrick Lamar": {
        "listeners": 3240938,
        "bio_summary": "Kendrick Lamar Duckworth (born June 17, 1987), professionally known as Kendrick Lamar, is a rapper from Compton, California. He is also a member of the hip-hop supergroup Black Hippy collective along with members Jay Rock, Ab-Soul, and Schoolboy Q. His music is largely influenced by the works of 2Pac, Jay-Z, Nas, DMX, The Notorious B.I.G., Mos Def, Eazy-E and Eminem.\n\nHe began to gain major recognition in 2010 after his first retail release, Overly Dedicated. <a href=\"https://www.last.fm/music/Kendrick+Lamar\">Read more on Last.fm</a>"
    },
    "Tyler, the Creator": {
        "listeners": 2547974,
        "bio_summary": "Tyler Gregory Okonma (born March 6, 1991) also known as Tyler, The Creator, is a Grammy award-winning American rapper, singer, record producer, director, fashion designer, and the head of his independent record label, Odd Future Records. He was the leader of the now-defunct Los Angeles, California, USA hip-hop collective Odd Future Wolf Gang Kill Them All (OFWGKTA). Since his first recordings had debuted on The Odd Future Tape in 2007, he had rapped on, and produced for, nearly every OFWGKTA release.  <a href=\"https://www.last.fm/music/Tyler,+the+Creator\">Read more on Last.fm</a>"
    },
    "Arctic Monkeys": {
        "listeners": 5278875,
        "bio_summary": "Arctic Monkeys is an indie rock band formed in Sheffield, South Yorkshire, England in 2002 after meeting at Stocksbridge High School. The band consists of Alex Turner (vocals, guitar, piano), Jamie Cook (guitar), Nick O'Malley (backing vocals, bass) and Matt Helders (drums, vocals). Founding bassist Andy Nicholson left in 2006.\n\nThe band has released seven studio albums: Whatever People Say I Am, That's What I'm Not (2006), Favourite Worst Nightmare (2007) <a href=\"https://www.last.fm/music/Arctic+Monkeys\">Read more on Last.fm</a>"
    },
    "Olivia Rodrigo": {
        "listeners": 1789853,
        "bio_summary": "Olivia Isabel Rodrigo is an American singer, songwriter, and actress. She gained recognition with her lead roles on the Disney television programs Bizaardvark and High School Musical: The Musical: The Series. After signing with Geffen and Interscope Records, Rodrigo released her debut single \"drivers license\" in 2021, which broke various records and became one of the best-selling songs of the year, propelling her to mainstream fame. She followed it up with the singles \"deja vu\" and \"good 4 u\". <a href=\"https://www.last.fm/music/Olivia+Rodrigo\">Read more on Last.fm</a>"
    },
    "Billie Eilish": {
        "listeners": 2481051,
        "bio_summary": "Billie Eilish Pirate Baird O'Connell (born December 18, 2001), known professionally as Billie Eilish, is a Grammy Award-winning American singer and songwriter signed to Darkroom/Interscope Records. Born and raised in Los Angeles, Eilish grew up in a household of actors and musicians and was homeschooled along with her brother Finneas O'Connell. At the age of eight, she joined the Los Angeles Children's Choir, developing the soulful vocals that would later appear on her early singles. <a href=\"https://www.last.fm/music/Billie+Eilish\">Read more on Last.fm</a>"
    },
    "Rihanna": {
        "listeners": 6369025,
        "bio_summary": "Robyn Rihanna Fenty (born February 20, 1988), professionally known by her middle name, Rihanna, is a Barbadian singer, songwriter, actress, businesswoman, entrepreneur  and fashion designer.\n\nShe has attained fourteen Billboard Hot 100 number ones thus far and is the second Barbadian artist to win a Grammy Award. She is also a cultural ambassador for Barbados. In 2021 Rihanna was named a \"National Hero\" in her home country, earning her the title \"The Right Excellent.\"  <a href=\"https://www.last.fm/music/Rihanna\">Read more on Last.fm</a>"
    },
    "SZA": {
        "listeners": 2113467,
        "bio_summary": "Solána Imani Rowe, known professionally as SZA, is an American singer and songwriter. She was born in St. Louis, Missouri but raised in Maplewood, New Jersey. She released her self-released debut EP, See.SZA.Run in October 2012. \n\nIn April 2013, SZA released her S EP to good critical reviews— in July of that same year, it was announced she was signed to Top Dawg Entertainment and began working on her Z EP, which would eventually become a full-fledged album. <a href=\"https://www.last.fm/music/SZA\">Read more on Last.fm</a>"
    },
    "Mitski": {
        "listeners": 1637651,
        "bio_summary": "Mitski Miyawaki (born Mitsuki Laycock) is a Japanese-American singer and songwriter. Born in Mie Prefecture, Japan to an American father and a Japanese mother, she moved frequently while growing up due to her father's job at the United States Department of State, living in Turkey, China, Malaysia, the Czech Republic and the Democratic Republic of Congo before settling in the United States. She sang in a choir in high school and was 18 when she wrote her first song on the piano. <a href=\"https://www.last.fm/music/Mitski\">Read more on Last.fm</a>"
    },
    "Frank Ocean": {
        "listeners": 2823299,
        "bio_summary": "Christopher Edwin Breaux, professionally known as Frank Ocean is an American singer/songwriter and member of the gleefully hedonistic hip-hop collective OFWGKTA. He was born on October 28, 1987 and lived in Long Beach, California. He has helped pen tracks for Justin Bieber, John Legend, Brandy, and Beyoncé over the last few years. In 2011, Ocean released his debut mixtape, Nostalgia, Ultra, for free via his Tumblr.\n\nVenting about his decision to drop the record his own way, he took to Twitter on March 1, 2011: <a href=\"https://www.last.fm/music/Frank+Ocean\">Read more on Last.fm</a>"
    },
    "Radiohead": {
        "listeners": 6207519,
        "bio_summary": "Radiohead is a English rock band formed in Abingdon, Oxfordshire, in 1985. The band consists of Thom Yorke (vocals, guitar, piano, keyboards); brothers Jonny Greenwood (lead guitar, keyboards, other instruments) and Colin Greenwood (bass); Ed O'Brien (guitar, backing vocals); and Philip Selway (drums, percussion). They have worked with the producer Nigel Godrich and the cover artist Stanley Donwood since 1994. Radiohead's experimental approach is credited with advancing the sound of alternative rock. <a href=\"https://www.last.fm/music/Radiohead\">Read more on Last.fm</a>"
    },
    "Travis Scott": {
        "listeners": 1709443,
        "bio_summary": "Jacques Webster (born April 30, 1992), better known by his stage name Travis Scott (stylized as Travi$ Scott), is an American hip hop recording artist and record producer from Houston, Texas. He is currently signed to Epic Records and T.I.'s Grand Hustle imprint, while signed to Kanye West's Very GOOD Beats as a producer. He first became widely known for his production and verse on GOOD Music's \"Sin City\". His debut EP Owl Pharaoh, was released on May 21, 2013. <a href=\"https://www.last.fm/music/+noredirect/Travis+Scott\">Read more on Last.fm</a>"
    },
    "Steve Lacy": {
        "listeners": 1725458,
        "bio_summary": "Steve Thomas Lacy-Moya (born May 23, 1998), better known as Steve Lacy, is an American musician, guitarist, bassist, singer-songwriter, and record producer. He was born in Compton, California, and gained recognition as a member of the Grammy-nominated R&B band, The Internet, in 2015. In February 2017, Lacy released his debut project, a song series, titled “Steve Lacy's Demo” and his debut album,  “Apollo XXI”, was released on May 2019. On December 4, 2020, Lacy released a compilation album titled “The Lo-Fis”. <a href=\"https://www.last.fm/music/Steve+Lacy\">Read more on Last.fm</a>"
    },
    "Ariana Grande": {
        "listeners": 2864636,
        "bio_summary": "Ariana Grande-Butera  is an American singer, songwriter and actress. She is a multi-platinum, Grammy Award-winning recording artist. Born in Boca Raton, Florida, Grande began her career in 2008 in the Broadway musical, 13. She rose to prominence for her role as Cat Valentine in the Nickelodeon television series, Victorious (2010–2013) and in its spin-off, Sam & Cat (2013–2014). As she grew interested in pursuing a music career, Grande recorded <a href=\"https://www.last.fm/music/Ariana+Grande\">Read more on Last.fm</a>"
    },
    "Tame Impala": {
        "listeners": 2745902,
        "bio_summary": "Tame Impala is a psychedelic rock band of Australian musician Kevin Parker, who writes, records, produces, and performs. As a touring act, Tame Impala consists of Parker (guitar, vocals), Dominic Simper (guitar, synthesiser), Jay Watson (synthesiser, vocals, guitar), Cam Avery (bass guitar, vocals), and Julien Barbagallo (drums, vocals). Many of the band members, including Parker, are collaborators with fellow Australian psychedelic rock band Pond. <a href=\"https://www.last.fm/music/Tame+Impala\">Read more on Last.fm</a>"
    },
    "Lady Gaga": {
        "listeners": 5509748,
        "bio_summary": "Stefani Joanne Angelina Germanotta, known professionally as Lady Gaga, (born March 28, 1986 in New York, NY) is an American singer, songwriter and actress. She is known for her image reinventions and musical versatility. Gaga began performing as a teenager, singing at open mic nights and acting in school plays. She studied at Collaborative Arts Project 21, through the New York University Tisch School of the Arts, before dropping out to pursue a career in music. <a href=\"https://www.last.fm/music/Lady+Gaga\">Read more on Last.fm</a>"
    },
    "Beyoncé": {
        "listeners": 5142099,
        "bio_summary": "Beyoncé Giselle Knowles-Carter is an American singer, songwriter and actress. Beyoncé performed in various singing and dancing competitions as a child. She rose to fame in the late 1990s as the lead singer of Destiny's Child, one of the best-selling girl groups of all time. Beyoncé is often cited as an influence by other artists.\n\nBorn and raised in Houston, Texas, Beyoncé began performing in local competitions at age 7, eventually forming the group Girl's Tyme in 1990 with help from her parents. <a href=\"https://www.last.fm/music/+noredirect/Beyonc%C3%A9\">Read more on Last.fm</a>"
    },
    "Childish Gambino": {
        "listeners": 2448374,
        "bio_summary": "Donald McKinley Glover, Jr (born September 25, 1983) is an American actor, comedian and musician. As a recording artist, he usually performs with the stage name Childish Gambino. While a disk jockey, he performs as mcDJ. He first came to attention for his work with Derrick Comedy and with the help of Tina Fey, was hired at the age of 21 to become a writer for the NBC comedy series 30 Rock. He later played college student Troy Barnes on the NBC sitcom Community. <a href=\"https://www.last.fm/music/Childish+Gambino\">Read more on Last.fm</a>"
    },
    "Coldplay": {
        "listeners": 7104779,
        "bio_summary": "Coldplay is a British alternative rock and britpop band formed in London in 1997. They consist of vocalist and pianist Chris Martin, guitarist Jonny Buckland, bassist Guy Berryman, drummer Will Champion and creative director Phil Harvey. They met at University College London and began playing music together from 1996 to 1998, initially calling themselves Starfish. Coldplay's music incorporates elements of soft rock, pop rock, piano rock, and post-britpop. <a href=\"https://www.last.fm/music/Coldplay\">Read more on Last.fm</a>"
    },
    "The Neighbourhood": {
        "listeners": 2458213,
        "bio_summary": "The Neighbourhood is an American alternative rock/dark pop band that formed in Newbury Park, California, USA in August 2011. The band consists of Jesse Rutherford, Jeremy Freedman, Zach Abels, and Mikey Margott.Brandon Fried (drums) was kicked out of the band on November 15 2022 after groping allegations.  Bryan Sammis (drums) left the group in January, 2014.\n\nThe band released their first EP, I'm Sorry... in January 2013, where their single Sweater Weather reached #1 on the U. <a href=\"https://www.last.fm/music/The+Neighbourhood\">Read more on Last.fm</a>"
    },
    "Harry Styles": {
        "listeners": 2126338,
        "bio_summary": "Harry Edward Styles (born 1 February 1994 in Redditch, Worcestershire, England) is a three-time GRAMMY award-winning, British singer, songwriter, and actor. As a member of the British/Irish boy band One Direction, singer Harry Styles topped the charts, toured the world, and sold millions of albums before going solo in 2016. Styles was raised in Holmes Chapel, Cheshire, and he made his first foray into music with a high-school band named White Eskimo. <a href=\"https://www.last.fm/music/Harry+Styles\">Read more on Last.fm</a>"
    },
    "Paramore": {
        "listeners": 3919555,
        "bio_summary": "Paramore is an American rock band formed in Franklin, Tennessee, United States in 2003. The band currently consists of Hayley Williams (vocals, keyboard), Taylor York (guitar) and Zac Farro (drums). They have released six studio albums: All We Know Is Falling, RIOT! , Brand New Eyes, their first Billboard 200 chart topper Paramore, After Laughter and their sixth studio album This is Why .\n\nParamore, as a quartet, released their debut studio album, All We Know Is Falling, in 2005. <a href=\"https://www.last.fm/music/Paramore\">Read more on Last.fm</a>"
    },
    "Bruno Mars": {
        "listeners": 3569914,
        "bio_summary": "Peter Gene Hernandez (born October 8, 1985 in Honolulu, HI, USA), known professionally as Bruno Mars, is a Filipino-American singer, songwriter, record producer, musician, and dancer. He is known for his stage performances, retro showmanship, and for performing in a wide range of musical styles, including pop, R&B, funk, soul, reggae, disco, and rock. Mars is accompanied by his band, the Hooligans, who play a variety of instruments, such as electric guitar, bass, piano, keyboards, drums, and horns, and also serve as backup singers and dancers. <a href=\"https://www.last.fm/music/Bruno+Mars\">Read more on Last.fm</a>"
    },
    "Post Malone": {
        "listeners": 2315947,
        "bio_summary": "Austin Richard Post (born July 4, 1995), known professionally as Post Malone, is an American rapper, singer, songwriter, and record producer. Known for his variegated vocals, Malone has gained acclaim for blending genres and subgenres of hip-hop, pop, R&B, and trap. His stage name was derived from inputting his birth name into a rap name generator\n\nMalone began his music career in 2011 and gained recognition with his 2015 debut single \"White Iverson\", which peaked at number 14 on the US Billboard Hot 100. <a href=\"https://www.last.fm/music/Post+Malone\">Read more on Last.fm</a>"
    },
    "Kali Uchis": {
        "listeners": 1744073,
        "bio_summary": "Karly-Marina Loaiza, professionally known as Kali Uchis, is a Colombian-American singer-songwriter, record producer, music video director and fashion designer. She writes and produces most of her own music.\n\nThe stylistic range of left-field pop artist Kali Uchis is reflected in the variety of her collaborators – an extensive genre-crossing list that includes Tyler, the Creator, Gorillaz, Daniel Caesar, Juanes, and BadBadNotGood. A singer, songwriter <a href=\"https://www.last.fm/music/Kali+Uchis\">Read more on Last.fm</a>"
    },
    "Metro Boomin": {
        "listeners": 1416706,
        "bio_summary": "Leland Tyler Wayne, better known by his stage name Metro Boomin, is a highly successful record producer, record executive, songwriter, and DJ. Born on September 16, 1993, in St. Louis, Missouri, Wayne began his career in music production while still in high school. He quickly gained recognition for his work with Atlanta-based hip hop and trap artists such as Future, 21 Savage, Gucci Mane, and Migos, and has since become one of the most sought-after producers in the industry. <a href=\"https://www.last.fm/music/Metro+Boomin\">Read more on Last.fm</a>"
    },
    "The Smiths": {
        "listeners": 3500884,
        "bio_summary": "The Smiths were an English rock band formed in Manchester in 1982. They comprised the singer Morrissey, the guitarist Johnny Marr, the bassist Andy Rourke and the drummer Mike Joyce. They are regarded as one of the most important acts to emerge from the 1980s British independent music scene.\n\nThe Smiths signed to the independent label Rough Trade Records in 1983 and released their first album, The Smiths, in 1984. They based their songs on the songwriting partnership of Morrissey and Marr. <a href=\"https://www.last.fm/music/The+Smiths\">Read more on Last.fm</a>"
    },
    "pinkpantheress": {
        "listeners": 1462938,
        "bio_summary": "PinkPantheress is an English singer, songwriter, and record producer from Bath, England, to a Kenyan mother, who works as a carer, and an English father, who works as an academic and is based in the United States. In her early teens, she was the lead singer in a My Chemical Romance cover band, and performed with them for the first time at a school fête. While attending secondary school in Kent, she started writing music to help a friend before eventually writing music on her own. <a href=\"https://www.last.fm/music/pinkpantheress\">Read more on Last.fm</a>"
    },
    "Nirvana": {
        "listeners": 5749903,
        "bio_summary": "There are multiple artists tracked as \"Nirvana\" on Last.fm. Following are six, listed in order of prominence:\n\n1) Nirvana was a popular and highly influential American grunge band. The band formed in Aberdeen, Washington in 1987, and it was part of the Seattle grunge scene of the late 80s, alongside bands like Pearl Jam, Alice in Chains and Soundgarden. As their popularity rose, alternative rock became a dominant genre on American and Canadian radio and music television during the early-to-mid '90s. <a href=\"https://www.last.fm/music/Nirvana\">Read more on Last.fm</a>"
    },
    "Gorillaz": {
        "listeners": 5113185,
        "bio_summary": "Gorillaz is a British virtual band created in 1998 by musician Damon Albarn and artist Jamie Hewlett. Canonically speaking, Murdoc Niccals formed the band. The band currently consists of four animated members: 2-D (lead vocals, keyboards), Noodle (guitar, vocals), Murdoc Niccals (bass guitar), and Russel Hobbs (drums and percussion). Their fictional universe is explored through animated music videos, interviews, and animated shorts. In reality, Albarn is the only permanent musical contributor, and often collaborates with other musicians. <a href=\"https://www.last.fm/music/Gorillaz\">Read more on Last.fm</a>"
    },
    "Mac DeMarco": {
        "listeners": 1898352,
        "bio_summary": "Mac DeMarco (born Vernor Winfield MacBriare Smith IV in Duncan, BC, on 30 April 1990) is a Canadian singer-songwriter, multi-instrumentalist and producer. DeMarco has released eight full-length studio albums, his debut Rock and Roll Night Club (2012), 2 (2012), Salad Days (2014), Another One (2015), This Old Dog (2017), Here Comes the Cowboy (2019), Five Easy Hot Dogs (2023), and One Wayne G (2023).\n\nDuring high school DeMarco was in several bands <a href=\"https://www.last.fm/music/Mac+DeMarco\">Read more on Last.fm</a>"
    },
    "LIL UZI VERT": {
        "listeners": 1660122,
        "bio_summary": "Symere Bysil Woods (born July 31, 1995, Philadelphia, USA), known professionally as Lil Uzi Vert, is an American rapper, singer, and songwriter. Characterized by their face tattoos, facial piercings, eccentric hairstyles, and androgynous fashion, their music is often defined by dark subject matters and imagery built on a melodic emo approach to trap.\n\nThey attracted mainstream attention following the release of their debut single \"Money Longer\" in 2016. <a href=\"https://www.last.fm/music/LIL+UZI+VERT\">Read more on Last.fm</a>"
    },
    "Katy Perry": {
        "listeners": 5339529,
        "bio_summary": "Katheryn Elizabeth Hudson, known professionally as Katy Perry (born October 25, 1984 in Santa Barbara, CA) is an American singer, songwriter, and television judge. The story of who was born into a totally Christian environment and who years later would become a pop music star. Muse of those who feel different or excluded, Katy Perry got her first guitar (from the church) at the age of thirteen and dreamed of it, as many young people do. The difference is that she did it. <a href=\"https://www.last.fm/music/Katy+Perry\">Read more on Last.fm</a>"
    },
    "Nicki Minaj": {
        "listeners": 3554300,
        "bio_summary": "Onika Tanya Maraj, born on December 8th, 1982, better known by her stage name Nicki Minaj, is a Trinidadian-American, rapper and singer-songwriter signed to a joint venture between Lil Wayne's Young Money Entertainment and Universal Motown. After releasing several mixtapes and building substantial buzz online her debut album, Pink Friday, was released on November 22, 2010. In October 2010, Minaj became the first female to have seven songs simultaneously chart on the Billboard Hot 100. <a href=\"https://www.last.fm/music/Nicki+Minaj\">Read more on Last.fm</a>"
    },
    "TV Girl": {
        "listeners": 1315492,
        "bio_summary": "TV Girl is a Los Angeles-based American band consisting of Brad Petering, Jason Wyman, and Wyatt Harmon. The band describes their music as indie pop and something \"you can sing along to, but wouldn't sing around your parents\".  TV Girl's Todd Rundgren sampling song \"If You Want It\" gained traction on the internet and became popular enough for Warner Music Group to take notice and take it down. \n \n <a href=\"https://www.last.fm/music/TV+Girl\">Read more on Last.fm</a>"
    },
    "Mac Miller": {
        "listeners": 2401787,
        "bio_summary": "Malcolm McCormick, also known by his stage name Mac Miller, was an American rapper, singer-songwriter and record producer from Pittsburgh, Pennsylvania. He was also a noted record producer under the pseudonym Larry Fisherman. Raised Jewish and teaching himself music from a young age, McCormick defied the stereotypes of hip-hop and released his first mixtape under the name EZ Mac, titled \"But My Mackin' Ain't Easy\" in 2007, when McCormick was only fifteen. <a href=\"https://www.last.fm/music/Mac+Miller\">Read more on Last.fm</a>"
    },
    "Dua Lipa": {
        "listeners": 2149447,
        "bio_summary": "Dua Lipa (born August 22, 1995) is an English-Albanian singer-songwriter. She was born in London of refugee parents from The Republic of Kosovo, where she grew up part of her life, but saw everything change when as a child she moved back to her parents' homeland. While still in her teens, she returned to the British capital alone, inspired by her singer father to pursue an artistic life.\n\nDua Lipa began to write her name in the music industry. Lipa <a href=\"https://www.last.fm/music/Dua+Lipa\">Read more on Last.fm</a>"
    },
    "Eminem": {
        "listeners": 6155316,
        "bio_summary": "Marshall Bruce Mathers III (born October 17, 1972, in St. Joseph, MO), known professionally as Eminem (often stylized as EMINƎM), is an American rapper, songwriter, record producer, record executive, and actor.\n\nEminem is the best-selling artist of the 2000s in the United States. Throughout his career, he has had 10 number-one albums on the Billboard 200 and five number-one singles on the Billboard Hot 100. With more than 47.4 million albums and 107. <a href=\"https://www.last.fm/music/Eminem\">Read more on Last.fm</a>"
    },
    "Fleetwood Mac": {
        "listeners": 3415254,
        "bio_summary": "Fleetwood Mac is a British-American rock band, formed in London in 1967. Fleetwood Mac was founded by guitarist Peter Green, drummer Mick Fleetwood and guitarist Jeremy Spencer, before bassist John McVie joined the lineup for their self-titled debut album. Danny Kirwan joined as a third guitarist in 1968. Keyboardist Christine Perfect (later known as Christine McVie), who contributed as a session musician from the second album, married McVie and joined in 1970. <a href=\"https://www.last.fm/music/Fleetwood+Mac\">Read more on Last.fm</a>"
    },
    "Lorde": {
        "listeners": 2596122,
        "bio_summary": "Ella Marija Lani Yelich-O'Connor, known professionally as Lorde (born 7 November 1996 in Takapuna, Auckland, New Zealand), is a New Zealand singer-songwriter. Taking inspiration from aristocracy for her stage name, she is known for her unconventional musical styles and introspective songwriting.\n\nLorde expressed interest in performing at local venues in her early teens. She signed with Universal Music Group (UMG) in 2009 and collaborated with producer Joel Little in 2011 to start recording music. <a href=\"https://www.last.fm/music/Lorde\">Read more on Last.fm</a>"
    },
    "Playboi Carti": {
        "listeners": 1347311,
        "bio_summary": "Jordan Terrell Carter (born September 13, 1996), popularly known as Playboi Carti, is an American rapper from Atlanta, Georgia. His eponymous debut mixtape was released on April 14, 2017. He originally went by the moniker Sir Cartier (stylized as $ir Cartier) when he embarked on his music career in 2011.\n\nHe originally started rapping as  Sir Cartier, releasing a mixtape titled THC: THE HIGH CHRONICAL$ on November 5, 2011, that has since been deleted from the Internet. <a href=\"https://www.last.fm/music/Playboi+Carti\">Read more on Last.fm</a>"
    },
    "Clairo": {
        "listeners": 1573984,
        "bio_summary": "Clairo is the stage name for singer-songwriter Claire Cottrill, whose song \"Pretty Girl\" went viral in late 2017 on YouTube. At 19 years old, Clairo opened a show for rapper Tyler, the Creator and had her music featured on The Le Sigh, a blog for female and nonbinary rising musicians. She is the daughter of Geoff Cottrill, a famous marketer who held high-ranking positions at Converse, Coca-Cola, and Procter & Gamble.\n\nOn May 25, 2018, Claire released the EP \"Diary 001\", featuring 6 tracks, many of which were previously released as singles. <a href=\"https://www.last.fm/music/Clairo\">Read more on Last.fm</a>"
    },
    "Miley Cyrus": {
        "listeners": 3594746,
        "bio_summary": "Miley Ray Cyrus (born Destiny Hope Cyrus, November 23, 1992 in Franklin, TN) is an American singer, songwriter and actress. Known for her distinctive raspy voice, her music incorporates elements of varied styles and genres, including pop, country pop, hip hop, experimental and rock. She has attained the most US Billboard 200 top-five albums in the 21st century by a female artist, with a total of fourteen entries.\nCyrus, a daughter of country music singer Billy Ray Cyrus <a href=\"https://www.last.fm/music/Miley+Cyrus\">Read more on Last.fm</a>"
    },
    "Queen": {
        "listeners": 5560780,
        "bio_summary": "Queen is an English rock band originally consisting of four members: vocalist and pianist Freddie Mercury, guitarist Brian May, bass guitarist John Deacon, and drummer Roger Taylor.\n\nThe band formed in London in 1970 after May and Taylor's former band Smile split after having released an album and single. Freddie replaced lead vocalist Tim Staffell, after the latter's departure from the original trio. \n\nThere was much deliberation as to what the band's name would be. <a href=\"https://www.last.fm/music/Queen\">Read more on Last.fm</a>"
    },
    "Joji": {
        "listeners": 1847092,
        "bio_summary": "George Miller, known by his stage name Joji, is a Japanese-Australian singer-songwriter, rapper, record producer, and former YouTube personality under his previous alias \"Filthy Frank\".\n\nIn 2013, on the DizastaMusic YouTube channel, Miller created the video \"Do the Harlem Shake (Original),\" which originated from a clip of the video \"Filthy Compilation #6 – Smell My Fingers\",the video has been viewed 60 million times (as of February 2019). The original clip led to the creation of the Harlem Shake meme <a href=\"https://www.last.fm/music/Joji\">Read more on Last.fm</a>"
    },
    "The Beatles": {
        "listeners": 5015791,
        "bio_summary": "The Beatles were an English rock band formed in Liverpool in 1960. With the line-up comprising John Lennon, Paul McCartney,  George Harrison and Ringo Starr, they are regarded as one of the most influential bands of all time. The group was integral to the development of 1960s counterculture and popular music's recognition as an art form. Rooted in skiffle, beat and 1950s rock and roll, their sound incorporated elements of classical music and traditional <a href=\"https://www.last.fm/music/The+Beatles\">Read more on Last.fm</a>"
    },
    "A$AP Rocky": {
        "listeners": 2151159,
        "bio_summary": "Rakim Athelaston Mayers, known professionally as A$AP Rocky, is an American rapper, record producer and record executive. Born and raised in Harlem, he embarked on his musical career as a member of the hip hop collective A$AP Mob, from which he adopted his moniker. In August 2011, Rocky's single \"Peso\" was leaked online and within weeks began receiving radio airplay. Rocky released his debut mixtape Live.Love.A$AP, later that year to widespread critical acclaim. <a href=\"https://www.last.fm/music/A$AP+Rocky\">Read more on Last.fm</a>"
    },
    "J. Cole": {
        "listeners": 2839880,
        "bio_summary": "Jermaine Lamarr Cole (born January 28, 1985), better known by his stage name J. Cole, is an American hip hop recording artist and record producer. Born in Frankfurt, Germany, Raised in Fayetteville, North Carolina, Cole posted songs on various internet forums at the age of 14 under the name \"Blaza\", but later switched to the name \"Therapist\". \n\nCole initially gained recognition as a rapper following the release of his debut mixtape, The Come Up, in <a href=\"https://www.last.fm/music/J.+Cole\">Read more on Last.fm</a>"
    },
    "Troye Sivan": {
        "listeners": 1522525,
        "bio_summary": "Troye Sivan Mellet is an Australian singer, actor and former YouTuber. As a YouTube personality, Sivan uploaded video blogs regularly and, as of 2021, has over 7.3 million subscribers and over 1.3 billion total views. After gaining popularity as a singer on YouTube and in Australian talent competitions, Sivan signed with EMI Australia in 2013 and released his third EP, TRXYE (2014), which peaked at number five on the US Billboard 200. Its lead single, \"Happy Little Pill\", reached number ten on Australian music charts. <a href=\"https://www.last.fm/music/Troye+Sivan\">Read more on Last.fm</a>"
    },
    "Justin Bieber": {
        "listeners": 3199275,
        "bio_summary": "Justin Drew Bieber (born March 1, 1994 in London, Ontario, Canada) is a Grammy Award winning Canadian pop singer, songwriter, and multi-instrumentalist. Bieber was discovered in 2008 by American talent manager Scooter Braun, who came across Bieber's videos on YouTube and later became his manager. Braun arranged for him to meet with entertainer Usher Raymond in Atlanta, Georgia. Bieber was signed to Raymond Braun Media Group (RBMG), and then to an Island Records recording contract offered by record executive L.A. Reid. <a href=\"https://www.last.fm/music/Justin+Bieber\">Read more on Last.fm</a>"
    },
    "Jay-Z": {
        "listeners": 4578724,
        "bio_summary": "Shawn Corey Carter (born December 4, 1969 in Brooklyn, New York, United States), is an American rapper and former president and CEO of Roc-A-Fella Records. He is more commonly known by a variety of stage names including Shawn Corey Carter, Jay-Hova, Jiggaman, Young Hov, Shawn C. Carter, Hov, Shawn Carter, The Carter Administration. He is regarded as one of the most prolific and successful American blend artists of the mid-90s and early 2000s and is known for his use of metaphors <a href=\"https://www.last.fm/music/Jay-Z\">Read more on Last.fm</a>"
    },
    "xxxtentacion": {
        "listeners": 1711854,
        "bio_summary": "Jahseh Dwayne Onfroy (January 23, 1998 – June 18, 2018), better known by his stage name XXXTentacion, was an American rapper from Lauderhill, Florida. Onfroy was known for his versatility with his music, which ranges from aggressive, punk rock-inspired hip hop, to somber and slower R&B style songs, to even heavy metal. His music is known for the lofi sound quality of his vocals and songs, which normally are distorted and unmastered. His vocal style ranged from singing, rapping, and screaming. <a href=\"https://www.last.fm/music/xxxtentacion\">Read more on Last.fm</a>"
    },
    "Deftones": {
        "listeners": 2734080,
        "bio_summary": "Deftones is an American  alternative metal band from Sacramento, California, formed in 1988, consisting of Chino Moreno (lead vocals and guitar), Stephen Carpenter (guitar), Frank Delgado (keyboards and turntables), and Abe Cunningham (drums and percussion). Vega (formerly of Quicksand) took on bass duties from mid-2009 to ca. 2021 in substitution for Chi Cheng, who was seriously injured in an automobile accident in Santa Clara, California on November 4, 2008. <a href=\"https://www.last.fm/music/Deftones\">Read more on Last.fm</a>"
    },
    "NewJeans": {
        "listeners": 829398,
        "bio_summary": "NewJeans (Korean: 뉴진스) is a South Korean girl group formed by ADOR, a subsidiary of HYBE Corporation. The group is composed of five members: Minji (민지), Hanni (하니), Danielle (다니엘), Haerin (해린) and Hyein (혜인). The group released their debut single \"Attention\" on July 22, 2022, preceding their debut extended play 'New Jeans', which was released on August 1, 2022. On October 18, 2022, ADOR announced that NewJeans was preparing for their first-ever comeback. <a href=\"https://www.last.fm/music/NewJeans\">Read more on Last.fm</a>"
    },
    "The Strokes": {
        "listeners": 4414207,
        "bio_summary": "The Strokes is an American rock band from  Manhattan, New York, United States, formed in 1998. The band rose to fame in the early 2000s as a leading group in garage rock/post-punk revival. The band consists of Julian Casablancas (lead vocals), Nick Valensi (lead guitar), Albert Hammond, Jr. (rhythm guitar), Nikolai Fraiture (bass guitar) and Fabrizio Moretti (drums and percussion).\n\t \nUpon the release of their debut album, Is This It, in 2001, the group was met with much critical acclaim, being hailed by some as the \"saviors of rock and roll. <a href=\"https://www.last.fm/music/The+Strokes\">Read more on Last.fm</a>"
    },
    "Calvin Harris": {
        "listeners": 3653863,
        "bio_summary": "Adam Richard Wiles, known professionally as Calvin Harris, is a Scottish DJ, record producer, singer and songwriter. After focusing on self-sung projects, in 2012, Harris released his third studio album, 18 Months, involving various vocalists and more EDM into it—first establishing Harris internationally. The album included the 2011 Rihanna's record \"We Found Love\".\n\nHis debut studio album, I Created Disco, was released in June 2007. Its singles \"Acceptable in the 80s\" and \"The Girls\" both reached the top 10 in the UK. <a href=\"https://www.last.fm/music/Calvin+Harris\">Read more on Last.fm</a>"
    },
    "The Cure": {
        "listeners": 4055078,
        "bio_summary": "The Cure is a band which formed in 1976 in Crawley, England, United Kingdom. The band originally consisted of Robert Smith (vocals, guitar), Pearl Thompson (guitar), Michael Dempsey (bass) and Lol Tolhurst (drums), with the band's lineup overgoing several changes throughout the years and Smith remaining as the only constant member throughout the band's history. The band currently consists of Smith (vocals, guitar), Simon Gallup (bass), Roger O'Donnell (keyboards), Jason Cooper (drums) and Reeves Gabrels (guitar). <a href=\"https://www.last.fm/music/The+Cure\">Read more on Last.fm</a>"
    },
    "Baby Keem": {
        "listeners": 1155360,
        "bio_summary": "Hykeem Jamaal Carter Jr. (born October 22, 2000), professionally known as Baby Keem, is an American rapper, singer, songwriter, and record producer, that grew up in Carson, California. He initially gained major recognition following the release of his single \"Orange Soda\", from his second mixtape Die for My Bitch (2019), which peaked at number 98 on the US Billboard Hot 100 chart. He would later go on to collaborate with prominent rappers such as Travis Scott and his cousin Kendrick Lamar <a href=\"https://www.last.fm/music/Baby+Keem\">Read more on Last.fm</a>"
    },
    "Future": {
        "listeners": 1884751,
        "bio_summary": "Nayvadius DeMun Cash, born Nayvadius DeMun Wilburn, (November 20, 1983), better known by his stage name Future, is an American rapper, singer, songwriter, and record producer from the Kirkwood neighborhood of Atlanta, Georgia.\n\nAfter releasing a series of moderately successful mixtapes between 2010 and 2011, Future signed a major label deal with Epic Records and fellow American rapper Rocko's A1 Recordings, which helped launch his own label imprint Freebandz. <a href=\"https://www.last.fm/music/Future\">Read more on Last.fm</a>"
    },
    "Michael Jackson": {
        "listeners": 4976303,
        "bio_summary": "Michael Joseph Jackson  (August 29, 1958 Gary, Indiana—June 25, 2009 in Los Angeles, California), was an American singer, songwriter and dancer. Dubbed the King of Pop, he is widely regarded as one of the most significant cultural figures of the 20th century and one of the greatest entertainers of all time. He was also known for his philanthropy, charitable fundraising, and lifestyle, residing in a private amusement park he called Neverland Ranch and often becoming the focus of tabloid scrutiny. <a href=\"https://www.last.fm/music/Michael+Jackson\">Read more on Last.fm</a>"
    },
    "Maroon 5": {
        "listeners": 4964806,
        "bio_summary": "Maroon 5 is an American pop rock band that originated in Los Angeles, California, United States. The group was formed in 1994 as Kara's Flowers while its members were still in high school and originally consisted of Adam Levine (lead vocals, guitar), Jesse Carmichael (guitar, backing vocals) Mickey Madden (bass guitar) and Ryan Dusick (drums). Kara's Flowers signed to Reprise Records and released an album, \"The Fourth World\", in 1997. After a tepid response to the album <a href=\"https://www.last.fm/music/Maroon+5\">Read more on Last.fm</a>"
    },
    "Adele": {
        "listeners": 4266427,
        "bio_summary": "Adele Laurie Blue Adkins MBE (born May 5, 1988) is an English singer and songwriter. After graduating in arts from the BRIT School in 2006, Adele signed a record deal with XL Recordings. Her debut album, 19, was released in 2008 and spawned the UK top-five singles \"Chasing Pavements\" and \"Make You Feel My Love\". The album was certified 8× platinum in the UK and triple platinum in the US. Adele was honoured with the Brit Award for Rising Star as well as the Grammy Award for Best New Artist. <a href=\"https://www.last.fm/music/Adele\">Read more on Last.fm</a>"
    },
    "Britney Spears": {
        "listeners": 4649331,
        "bio_summary": "Britney Jean Spears  (born December 2, 1981 in McComb, MS) is an American singer, songwriter and dancer. She is credited with influencing the revival of teen pop during the late 1990s and early 2000s, for which she is referred to as the \"Princess of Pop\". Regarded as a pop icon, Spears has sold nearly 150 million records worldwide, including over 70 million solely in the United States, making her one of the world's best-selling music artists.\n\nShe has officially released nine studio albums to date: . <a href=\"https://www.last.fm/music/Britney+Spears\">Read more on Last.fm</a>"
    },
    "Charli XCX": {
        "listeners": 1930480,
        "bio_summary": "Charlotte Emma Aitchison, known professionally as Charli XCX, is an English singer and songwriter. Born in Cambridge and raised in Start Hill, Essex, she began posting songs on Myspace in 2008, which led to her discovery by a promoter who invited her to perform at warehouse raves and parties. In 2010, she signed a recording contract with Asylum Records, releasing a series of singles and mixtapes throughout 2011 and 2012.\n\nIn 2012, Charli XCX rose to prominence with the Icona Pop collaboration \"I Love It\" <a href=\"https://www.last.fm/music/Charli+XCX\">Read more on Last.fm</a>"
    },
    "Cigarettes After Sex": {
        "listeners": 1504546,
        "bio_summary": "Cigarettes After Sex is an American ambient pop musical group led by Greg Gonzalez, founded in El Paso, Texas in 2008. Gonzalez recorded the first EP, I., in a four-story stairway at his alma mater, University of Texas at El Paso. Gonzalez relocated to Brooklyn, NY where the band's single, \"Affection\", was recorded and released in 2015 along with a cover of REO Speedwagon's \"Keep On Loving You\".\n\nThrough music recommendations, Cigarettes After Sex has gained millions of views on YouTube leading to live performances across Europe & the US. <a href=\"https://www.last.fm/music/Cigarettes+After+Sex\">Read more on Last.fm</a>"
    },
    "Green Day": {
        "listeners": 4933136,
        "bio_summary": "Green Day is an American rock band formed in the East Bay of California in 1987 by lead vocalist and guitarist Billie Joe Armstrong, together with bassist and backing vocalist Mike Dirnt. For most of the band's career, they have been a power trio with drummer Tré Cool, who replaced John Kiffmeyer in 1990 before the recording of the band's second studio album, Kerplunk (1991). Touring guitarist Jason White became a full-time member in 2012, but returned to his touring role in 2016. <a href=\"https://www.last.fm/music/Green+Day\">Read more on Last.fm</a>"
    },
    "Hozier": {
        "listeners": 2041854,
        "bio_summary": "Andrew Hozier-Byrne (born 17 March 1990), known mononymously as Hozier, is an Irish musician and singer-songwriter from Bray, County Wicklow, Ireland. In 2013 he released his debut EP, featuring the hit single \"Take Me to Church\", and his second EP \"From Eden\" in 2014. His debut studio album, \"Hozier\", was released in Ireland in September 2014 and globally in October 2014.\n\nHozier was born in Bray, County Wicklow, Ireland.  His mother is the visual artist Raine Hozier-Byrne (who also designed his latest album cover). <a href=\"https://www.last.fm/music/Hozier\">Read more on Last.fm</a>"
    },
    "Brent Faiyaz": {
        "listeners": 1098800,
        "bio_summary": "Christopher Brent Wood (born September 19, 1995) better known as Brent Faiyaz is an R&B singer/producer based out of Baltimore, Maryland.\n\nOn September 18, 2016 Faiyaz dropped his EP A.M. Paradox; catching the attention of Goldlink. Just 2 months later on December 16, 2016, Goldlink collabed with Faiyaz and Shy Glizzy (Now Young Jefe) to create the behemoth single “Crew”. <a href=\"https://www.last.fm/music/Brent+Faiyaz\">Read more on Last.fm</a>"
    },
    "Foo Fighters": {
        "listeners": 5043713,
        "bio_summary": "Foo Fighters is an American rock band formed in Seattle in 1994. Foo Fighters was initially formed as a one-man project by former Nirvana drummer Dave Grohl. Following the success of the eponymous debut album, Grohl (lead vocals, guitar) recruited a band consisting of Nate Mendel (bass guitar), William Goldsmith (drums), and Pat Smear (guitar). After a succession of lineup changes, including the departures of Goldsmith and Smear, the band formed its core lineup in 1999 consisting of Grohl <a href=\"https://www.last.fm/music/Foo+Fighters\">Read more on Last.fm</a>"
    },
    "Linkin Park": {
        "listeners": 5105899,
        "bio_summary": "Linkin Park is an American rock band from Agoura Hills, California. The band's current lineup comprises vocalist/rhythm guitarist/keyboardist Mike Shinoda, lead guitarist Brad Delson, bassist Dave Farrell, DJ/turntablist Joe Hahn and drummer Rob Bourdon, all of whom are founding members. Vocalists Mark Wakefield and Chester Bennington are former members of the band. Categorized as alternative rock, Linkin Park's earlier music spanned a fusion of heavy metal and hip hop, while their later music features more electronica and pop elements. <a href=\"https://www.last.fm/music/Linkin+Park\">Read more on Last.fm</a>"
    },
    "Phoebe Bridgers": {
        "listeners": 1292233,
        "bio_summary": "Phoebe Lucille Bridgers (born August 17, 1994) is an American indie musician from Los Angeles, California. Best known for her work as a solo singer-songwriter, she is also known for being part of the musical groups boygenius (with Julien Baker and Lucy Dacus) and Better Oblivion Community Center (with Conor Oberst). Bridgers made her solo debut with the studio album Stranger in the Alps (2017), followed by Punisher (2020) which earned Bridgers widespread critical acclaim and four Grammy Award nominations, including Best New Artist. <a href=\"https://www.last.fm/music/Phoebe+Bridgers\">Read more on Last.fm</a>"
    },
    "Red Hot Chili Peppers": {
        "listeners": 5744392,
        "bio_summary": "The Red Hot Chili Peppers is an American rock band formed in Los Angeles in 1982. Their music incorporates elements of alternative rock, funk, punk rock and psychedelic rock. The band consists of co-founders Anthony Kiedis (lead vocals) and Flea (bass), as well as drummer Chad Smith, and guitarist John Frusciante, the latter of whom has been in the band across three stints. With over 100 million records sold worldwide, the Red Hot Chili Peppers are one of the best-selling bands of all time. <a href=\"https://www.last.fm/music/Red+Hot+Chili+Peppers\">Read more on Last.fm</a>"
    },
    "beabadoobee": {
        "listeners": 1202596,
        "bio_summary": "Beatrice (Bea) Kristi Ilejay Laus (born June 3, 2000 in the Philippines), known as beabadoobee, is a London-based singer-songwriter. She has formed her own independent, unique bedroom-acoustic sound pulling heartstrings with every beat. Her sensational melodies are influenced by artists like Alex G, Karen O and Florist.\n\nShe has released a collection of EPs (\"Lice\", \"Patched Up\", \"Loveworm\", \"Space Cadet\"), her debut full-length album \"Fake It Flowers\" in 2020, her sophomore album \"Beatopia\" in 2022, and her hit single \"Glue Song\" in 2023. <a href=\"https://www.last.fm/music/beabadoobee\">Read more on Last.fm</a>"
    },
    "21 Savage": {
        "listeners": 1265677,
        "bio_summary": "Shéyaa Bin Abraham-Joseph (born October 22, 1992), known professionally as 21 Savage, is a rapper based in Atlanta, Georgia, United States. Born in London, he moved to Atlanta with his mother at age seven. He became known after releasing two mixtapes in 2015, before attaining international attention with the release of the collaborative EP Savage Mode (2016) with Metro Boomin; its singles \"X\" (featuring Future) and \"No Heart\" peaked within the top <a href=\"https://www.last.fm/music/21+Savage\">Read more on Last.fm</a>"
    },
    "Ed Sheeran": {
        "listeners": 3079574,
        "bio_summary": "Edward Christopher \"Ed\" Sheeran MBE (born 17 February 1991) is a singer songwriter currently signed under Atlantic (WMG).  Ed Sheeran was born in Halifax, West Yorkshire before moving to Framlingham, Suffolk. In his time in Suffolk, he was known to have flourished as a hidden talent when it came to music. He learned guitar at a very young age, and began writing songs during his time at Thomas Mills High School in Framlingham. By the time Sheeran had left school <a href=\"https://www.last.fm/music/Ed+Sheeran\">Read more on Last.fm</a>"
    },
    "Men I Trust": {
        "listeners": 1173738,
        "bio_summary": "Men I Trust is Dragos, Emma, Jessy, Mathieu and Alexis. Founded in 2014, the indie dance band from Montreal, Canada loves smooth sounds, calm melodies and simple rhythms that relax, but make your right foot tap and your chin bounce on the beats. They record, mix, master and shoot their music videos. \n\nJessy and Dragos knew each other since their fourth year of high school. Back then (mid-2000’s), Dragos had somewhat of a background in classical piano and Jessy mastered the dark and esoteric art of the metal guitar solist. <a href=\"https://www.last.fm/music/Men+I+Trust\">Read more on Last.fm</a>"
    },
    "Conan Gray": {
        "listeners": 1388712,
        "bio_summary": "Conan Gray is an American singer-songwriter and social media personality. He was born on December 5, 1998, in Lemon Grove, California. As an infant, his family moved to Hiroshima, Japan and short after returned to California, before settling in Georgetown, Texas.\n\nHe started his career on YouTube under his channel 'ConanxCanon' before officially changing to 'Conan Gray'.  While on his time on YouTube he released multiple original songs, with the most <a href=\"https://www.last.fm/music/Conan+Gray\">Read more on Last.fm</a>"
    },
    "Elton John": {
        "listeners": 3905507,
        "bio_summary": "Sir Elton Hercules John (born Reginald Kenneth Dwight; 25 March 1947) is a British singer, pianist, and composer. Collaborating with lyricist Bernie Taupin since 1967, John is one of the most successful artists of all time, having sold over 300 million records worldwide in a seven-decade career in music. He is acclaimed by critics and musicians, particularly for his work during the 1970s, and his lasting impact on the music industry. John's music and showmanship have had a significant impact on popular music. <a href=\"https://www.last.fm/music/Elton+John\">Read more on Last.fm</a>"
    },
    "My Chemical Romance": {
        "listeners": 3469389,
        "bio_summary": "My Chemical Romance is an American rock band from New Jersey, United States formed in 2001. The band consists of lead vocalist Gerard Way, guitarists Ray Toro, Frank Iero and bassist Mikey Way. Shortly after forming, the band signed to Eyeball Records and released their debut album I Brought You My Bullets, You Brought Me Your Love in 2002. They signed with Reprise Records the next year and released their major label debut Three Cheers for Sweet Revenge <a href=\"https://www.last.fm/music/My+Chemical+Romance\">Read more on Last.fm</a>"
    },
    "Girl In Red": {
        "listeners": 1385360,
        "bio_summary": "girl in red is the indie pop music project of Norwegian singer-songwriter and record producer Marie Ulven Ringheim. She appeared on the scene with her homemade, bedroom pop songs about romance and mental health featured on the early EPs Chapter 1 (2018) and Chapter 2 (2019). Her debut studio album If I Could Make It Go Quiet was released through AWAL on April 30, 2021.\n\nGirl in Red has been cited as a queer icon by Paper, and a \"phenomenon\" who is <a href=\"https://www.last.fm/music/Girl+In+Red\">Read more on Last.fm</a>"
    },
    "Imagine Dragons": {
        "listeners": 2992636,
        "bio_summary": "Imagine Dragons is a Grammy award-winning alternative rock band which formed in 2008 in Las Vegas, Nevada, United States. The band consists of Dan Reynolds (vocals), Wayne Sermon (guitar), Ben McKee (bass) and Daniel Platzman (drums). The band released four EPs - \"Imagine Dragons\" (2009), \"Hell and Silence\" (2010), \"It's Time\" (2011) and \"Continued Silence\" (2012) - before releasing their debut full length album \"Night Visions\" on 4 September 2012. <a href=\"https://www.last.fm/music/Imagine+Dragons\">Read more on Last.fm</a>"
    },
    "Daft Punk": {
        "listeners": 4978161,
        "bio_summary": "Daft Punk was a multi Grammy Award-winning electronic music duo formed in 1993 in Paris, France, and separated in early 2021, consisting of French musicians Thomas Bangalter (born 3 January 1975) and Guy-Manuel de Homem-Christo (born 8 February 1974). The band is considered one of the most successful electronic music collaborations of all time, both in album sales and in critical acclaim. \n\nDaft Punk reached significant popularity in the late 90s house movement in France, along with other artists such as Air, Cassius, and Dimitri From Paris. <a href=\"https://www.last.fm/music/Daft+Punk\">Read more on Last.fm</a>"
    },
    "Kid Cudi": {
        "listeners": 3703100,
        "bio_summary": "Scott Ramon Seguro Mescudi (born January 30, 1984 in Shaker Heights, Ohio, United States), better known by his stage name KiD CuDi, is a Grammy award nominated rapper, singer and actor who first gained attention after the release of his debut mixtape A Kid Named Cudi which he released in 2008 in collaboration with New York street wear brand 10.Deep. The mixtape caught the attention of Kanye West and led to Cudi's signing to the G.O.O.D. Music Label. <a href=\"https://www.last.fm/music/Kid+Cudi\">Read more on Last.fm</a>"
    },
    "Pink Floyd": {
        "listeners": 4187486,
        "bio_summary": "Pink Floyd was an English rock band formed in London in 1965. Gaining an early following as one of the first British psychedelic groups, they were distinguished by their extended compositions, sonic experimentation, philosophical lyrics and elaborate live shows. They became a leading band of the progressive rock genre, cited by some as the greatest progressive rock band of all time.\n\nPink Floyd were founded in 1965 by Syd Barrett (guitar, lead vocals) <a href=\"https://www.last.fm/music/Pink+Floyd\">Read more on Last.fm</a>"
    },
    "Beach House": {
        "listeners": 2351861,
        "bio_summary": "Beach House is a dream pop group that formed in 2004 in Baltimore, Maryland, United States. The group consists of Victoria Legrand (vocals, organ) and Alex Scally (guitar, keyboards). Legrand is the niece of French composer Michel Legrand. The group has released eight albums: Beach House (2006), Devotion (2008), Teen Dream (2010), Bloom (2012), Depression Cherry (2015), Thank Your Lucky Stars (2015), 7 (2018), and Once Twice Melody (2022).\n\nWithin a year of formation <a href=\"https://www.last.fm/music/Beach+House\">Read more on Last.fm</a>"
    },
    "Alex G": {
        "listeners": 993677,
        "bio_summary": "Alex Giannascoli---whose stage name is \"Alex G\" and was temporarily \"(Sandy) Alex G\"---is a multi-instrumentalist from Philadelphia that has studied at Temple University, serving as a member of The Skin Cells. In general, he works as a guitarist and singer. \n\nHe started his career with DIY self-releases on Bandcamp and began building up an audience with his label debut, DSU (2014), released on Orchid Tapes to critical acclaim from various publications. <a href=\"https://www.last.fm/music/Alex+G\">Read more on Last.fm</a>"
    },
    "Gunna": {
        "listeners": 965506,
        "bio_summary": "Sergio Giavanni Kitchens (born June 14, 1993), known professionally as Gunna, is an American rapper, singer and songwriter. Best known for his collaborations with Young Thug and Lil Baby, he is signed to Thug's record label, YSL Records, as well as 300 Entertainment and Atlantic Records.[2] He released his debut studio album, Drip or Drown 2 on February 22, 2019 and followed it up with his second studio album Wunna on May 22, 2020, which debuted atop the Billboard 200.[3] <a href=\"https://www.last.fm/music/Gunna\">Read more on Last.fm</a>"
    },
    "Daniel Caesar": {
        "listeners": 1242999,
        "bio_summary": "Daniel Caesar’s first chapter unfolded in a suburb of Toronto, where he was born to Bajan and Jamaican parents and raised listening to soul and gospel music while singing in front of his father’s church congregation. The singer and songwriter left home at 17 to pursue his calling as a musical artist. Caesar independently released his first two EPs, Praise Break (2014) and Pilgrim’s Paradise (2017), to widespread praise—the first of which landed at #19 on Rolling Stone’s list of “20 Best R&B Albums of 2014. <a href=\"https://www.last.fm/music/Daniel+Caesar\">Read more on Last.fm</a>"
    },
    "Twenty One Pilots": {
        "listeners": 2018725,
        "bio_summary": "Twenty One Pilots (stylized in all lowercase or as twenty øne piløts) is an American musical duo from Columbus, Ohio. Initially a band, the group was formed in 2009 by lead vocalist Tyler Joseph along with Nick Thomas and Chris Salih, who both left in 2011. Since their departure, the line-up has consisted of Joseph and drummer Josh Dun. The duo is best known for their singles \"Stressed Out\", \"Ride\", and \"Heathens\". The group received a Grammy Award for Best Pop Duo/Group Performance at the 59th Annual Grammy Awards for \"Stressed Out\". <a href=\"https://www.last.fm/music/Twenty+One+Pilots\">Read more on Last.fm</a>"
    },
    "Eyedress": {
        "listeners": 1031485,
        "bio_summary": "Idris Vicuña (born May 28, 1990), professionally recognized as Eyedress, is a Filipino solo musician. Raised in the Philippines, particularly an area he described as a \"ghetto,\" Eyedress began playing the guitar at a young age. He and his family moved to Phoenix, Arizona, where he was introduced to punk music. At age 13, he and his family moved to Orange County, California. There he joined the crust punk band Liberal Underground as a bassist. He moved back to the Philippines at age 15 with his family.  <a href=\"https://www.last.fm/music/Eyedress\">Read more on Last.fm</a>"
    },
    "David Bowie": {
        "listeners": 4384841,
        "bio_summary": "David Robert Jones (8 January 1947 – 10 January 2016), known professionally as David Bowie, was an English singer-songwriter and actor. A leading figure in the music industry, he is regarded as one of the most influential musicians of the 20th century. Bowie was acclaimed by critics and musicians, particularly for his innovative work during the 1970s. His career was marked by reinvention and visual presentation, and his music and stagecraft had a significant impact on popular music. <a href=\"https://www.last.fm/music/David+Bowie\">Read more on Last.fm</a>"
    },
    "David Guetta": {
        "listeners": 4062056,
        "bio_summary": "Pierre David Guetta is a French DJ and music producer. He has sold over 10 million albums and 65 million singles globally, with more than 14 billion streams. In 2011, 2020, and 2021, Guetta was voted the number one DJ in the DJ Mag Top 100 DJs poll. In 2013, Billboard crowned \"When Love Takes Over\" as the number-one dance-pop collaboration of all time, with singer Kelly Rowland.\n\nHe released his first album, Just a Little More Love, in 2002. Later, he released Guetta Blaster (2004) and Pop Life (2007). <a href=\"https://www.last.fm/music/David+Guetta\">Read more on Last.fm</a>"
    },
    "Sabrina Carpenter": {
        "listeners": 1054257,
        "bio_summary": "Sabrina Ann Lynn Carpenter (Pennsylvania, May 11, 1999), better known as Sabrina Carpenter, is an American actress, singer and songwriter. She was known for her role in the Disney series \"Girl Meets World\", as Maya Hart. Sabrina was initially hired by Hollywood Records and became popular for her single \"Can't Blame a Girl for Trying\". In 2015, Sabrina released her debut album, entitled “Eyes Wide Open”, releasing the tracks “We'll Be The Stars” and the title track as a single. <a href=\"https://www.last.fm/music/Sabrina+Carpenter\">Read more on Last.fm</a>"
    },
    "Dominic Fike": {
        "listeners": 1192936,
        "bio_summary": "Dominic David Fike (Born December 30, 1995) is an American Singer and Alternative hip-hop artist from Naples, Florida. Fike first received recognition after releasing several popular songs on the website SoundCloud. Following the release of his debut EP, Don't Forget About Me, Demos, he signed to Columbia Records. Fike's song \"3 Nights\" reached the top ten in multiple countries. He later collaborated with the band BROCKHAMPTON and singer Halsey. In June 2020, Fike released the single \"Chicken Tenders\". <a href=\"https://www.last.fm/music/Dominic+Fike\">Read more on Last.fm</a>"
    },
    "One Direction": {
        "listeners": 2220322,
        "bio_summary": "One Direction (commonly abbreviated to 1D) is a UK-Irish boy group, active from 2010 until going on hiatus in 2016. The original 5-member group was made up of Liam Payne (born 29 August 1993) from Wolverhampton, Louis Tomlinson (born 24 December 1991) from Doncaster, Niall Horan (born 13th September 1993) from Mullingar, Westmeath, Ireland, Harry Styles, (born 1 February 1994) from Holmes Chapel, Cheshire and Zayn Malik, (born 12 January 1993) from East Bowling <a href=\"https://www.last.fm/music/One+Direction\">Read more on Last.fm</a>"
    },
    "Yung Lean": {
        "listeners": 806292,
        "bio_summary": "Jonatan Leandoer Håstad[3] (born 18 July, 1996), known professionally as Yung Lean, is a Swedish rapper, singer, songwriter, and record producer. Born and raised in Stockholm, Yung Lean rose to prominence in 2013 with his song \"Ginseng Strip 2002\" which became a viral success on YouTube.[4] Later the same year, he released his debut mixtape, Unknown Death 2002, and the following year he released his debut studio album, Unknown Memory. In 2016, Yung Lean released his second mixtape, Frost God and his second studio album, Warlord. <a href=\"https://www.last.fm/music/Yung+Lean\">Read more on Last.fm</a>"
    },
    "Seeb": {
        "listeners": 164924,
        "bio_summary": "SeeB is a norwegian EDM/tropical house trio consisting if Simen Eriksrud and Espen Berg. The group got famous by their remix of Mike Posner's song \"I Took a Pill in Ibiza\" released in 2015. <a href=\"https://www.last.fm/music/+noredirect/Seeb\">Read more on Last.fm</a>"
    },
    "ABBA": {
        "listeners": 2950341,
        "bio_summary": "ABBA is a Swedish pop group formed in Stockholm in  1972 by Agnetha Fältskog, Björn Ulvaeus, Benny Andersson, and Anni-Frid Lyngstad. The group's name is an acronym of the first letters of their first names. They became one of the most commercially successful acts in the history of popular music, topping the charts worldwide from 1974 to 1982. ABBA won the Eurovision Song Contest 1974 at The Dome in Brighton, UK, giving Sweden its first triumph in the contest. They are the most successful group to have taken part in the competition. <a href=\"https://www.last.fm/music/ABBA\">Read more on Last.fm</a>"
    },
    "Anna of the North": {
        "listeners": 363158,
        "bio_summary": "Anna Lotterud (born 8 June 1989), better known by her stage name Anna of the North, is an Oslo-based Norwegian singer-songwriter from Gjøvik. Her music has been regarded as \"soft, soul-baring electro-pop\". Her debut studio album, Lovers, was released in 2017. Her second album, Dream Girl, was released in October 2019.\n\nFor more info, visit soundcloud.com/annaofthenorth or facebook.com/annaofthenorth <a href=\"https://www.last.fm/music/Anna+of+the+North\">Read more on Last.fm</a>"
    },
    "Robyn": {
        "listeners": 1564189,
        "bio_summary": "\nRobyn is the stage name of the Swedish pop singer-songwriter Robin Miriam Carlsson (born 12 June 1979 in Stockholm, Sweden). She is best known for her critically acclaimed electropop music, her impressive live shows and the hits \"With Every Heartbeat\" (#1 UK) and \"Dancing On My Own\" (#8 UK, #1 Sweden). In 2011, the single \"Dancing On My Own\" was nominated at Grammy Awards for the category Best Dance Recording. She is the owner of Konichiwa Records, which release only her music, including Robyn and Body Talk.  <a href=\"https://www.last.fm/music/Robyn\">Read more on Last.fm</a>"
    },
    "Avicii": {
        "listeners": 2490584,
        "bio_summary": "Tim Bergling (born September 8, 1989 in Stockholm, Sweden, died April 20, 2018 in Muscat, Oman), better known by his stage name Avicii (stylized as ΛVICII and ◢ ◤), was a Swedish DJ, remixer and record producer. Avicii was ranked 3rd on DJ Magazine‍‍ '​‍s annual Top 100 DJs in 2012 and 2013 and has been nominated twice for a Grammy Award, once for his work on \"Sunshine\" with David Guetta in 2012 and once for his song \"Levels\" (which sampled the 1962 Etta James track \"Something's Got a Hold on Me\") in 2013. <a href=\"https://www.last.fm/music/Avicii\">Read more on Last.fm</a>"
    },
    "José González": {
        "listeners": 1941325,
        "bio_summary": "José González (born 1978 in Gothenburg, Sweden) is a Swedish indie folk singer-songwriter and guitarist (of Argentinian extraction). In 2003, he released his debut album, Veneer, in Europe. The album has since been released in the UK, on April 25, 2005, and in the United States on September 6, 2005. González is also a member of the Swedish band Junip, along with Elias Araya and Tobias Winterkorn.\n\nThe song Crosses, from Crosses EP and the later Veneer <a href=\"https://www.last.fm/music/+noredirect/Jos%C3%A9+Gonz%C3%A1lez\">Read more on Last.fm</a>"
    },
    "Björn Rosenström": {
        "listeners": 76810,
        "bio_summary": "Björn Rosenström was born 1970 in Gothenburg, Sweden. His first album, \"Låtar som är sådar\", was only spread among friends at first, back in 1996, but as rumour spread it became famous enough for a record label to distribute it in 1997. Within a year 110,000 copies were sold.\n\nAccompanied by a band consisting of brothers and friends, Björn has released six albums by now - one of them being a collection (in 2003).\n\nHis lyrics are centered around humor. <a href=\"https://www.last.fm/music/+noredirect/Bj%C3%B6rn+Rosenstr%C3%B6m\">Read more on Last.fm</a>"
    },
    "Iceage": {
        "listeners": 292353,
        "bio_summary": "Danish band Iceage started out as an abrasive punk rock quartet before exploring a more multifaceted approach to songwriting. The cold, abrasive, Joy Division-informed sound of early albums like their 2011 debut New Brigade quickly grew as the band expanded their concepts of instrumentation, arrangement, and atmosphere on more sophisticated outings like 2021's Seek Shelter.\n\nIceage formed in 2008, led by singer and guitarist Elias Bender Rønnenfelt, guitarist Johan Suurballe Wieth, bassist Jakob Tvilling Pless, and drummer Dan Kjær Nielsen. <a href=\"https://www.last.fm/music/Iceage\">Read more on Last.fm</a>"
    },
    "Dagny": {
        "listeners": 245179,
        "bio_summary": "Dagny (born Dagny Norvoll Sandvik on 23 July 1990 in Tromsø, Norway) is a Norwegian pop singer who had success with her debut single \"Backbeat\".\n\nExtensive touring in Norway, Sweden, Denmark and the UK lays the foundation for what is predicted to be a long and successful music career. \n\nWith her crystal voice, ranging from raw and powerful to intimate and soft, Dagny describes her music as an “emotional rollercoaster” with playful peaks and melancholic drops, “just as life itself” she says. <a href=\"https://www.last.fm/music/Dagny\">Read more on Last.fm</a>"
    },
    "Mando Diao": {
        "listeners": 962440,
        "bio_summary": "Mando Diao are a rock band from Borlänge, Sweden. According to the band, the name Mando Diao has no meaning at all, but rather appeared to band member Björn Dixgård in a dream. Their sound is influenced by The Animals and Oasis.\n\nThe roots of Mando Diao date back to 1995 when Björn Dixgård was a member of a band called Butler. Band members came and went;  four years later, the remaining line-up chose to proceed more seriously in their musical efforts. <a href=\"https://www.last.fm/music/Mando+Diao\">Read more on Last.fm</a>"
    },
    "CLMD": {
        "listeners": 111814,
        "bio_summary": "CLMD is a music project run by Norwegian house music DJ and producer, Martin Danielle. CLMD started as a duo between Carl Louis and Martin Danielle (the name of the act being made of the initials of the two members). Carl and Martin first met at the age of 6, and during their high school years, they got introduced to house music and the art of DJing. \n\nAs of the summer 2014, Carl decided to leave CLMD to focus on his solo career. Early 2015 brings CLMD (now branded as \"Create Love Music & Dreams\") back as a revitalized solo endeavor. <a href=\"https://www.last.fm/music/CLMD\">Read more on Last.fm</a>"
    },
    "Tungevaag": {
        "listeners": 171025,
        "bio_summary": "Norwegian artist, DJ and producer Martin Tungevaag started his musical career with his smash hit Wicked Wonderland back in 2014, which became a summer hit and led to shows at clubs and festival main stages all over Europe. Later the same year, Samsara reached number #1 on the charts.\n\nGRAMMY award-nominated, Multi-platinum status (80x awarded including Germany, Brasil, Austria, Italy, Sweden and more) as well as more than 1 Billion Spotify Streams in 5 years’ time, he is already one of the top 300 artist of all time on the platform. <a href=\"https://www.last.fm/music/Tungevaag\">Read more on Last.fm</a>"
    },
    "Swedish House Mafia": {
        "listeners": 1987891,
        "bio_summary": "Swedish House Mafia is a house music supergroup comprised of DJ/producers Axwell, Steve Angello, and Sebastian Ingrosso. Each of the group members is an accomplished DJ/producer and label owner in his own right. The Swedish group initially teamed up in the mid-2000s, when they toured together as DJs and collaborated from time to time on one another's productions. Eric Prydz was also a member of the group for a while. Axwell, Angello, and Ingrosso's breakout performance as Swedish House Mafia came on August 12 <a href=\"https://www.last.fm/music/Swedish+House+Mafia\">Read more on Last.fm</a>"
    },
    "Lykke Li": {
        "listeners": 2346760,
        "bio_summary": "Li Lykke Timotej Zachrisson, professionally known as Lykke Li, is a Swedish singer, songwriter and model. Her music often blends elements of indie pop, dream pop and electronic. Her debut studio album, Youth Novels, was released in 2008, and has been followed by Wounded Rhymes (2011), I Never Learn (2014), So Sad So Sexy (2018) and Eyeye (2022).\n\nShe was born in Ystad, Skåne; her mother, Kärsti Stiege, was a photographer, and her father, Johan Zachrisson, is a member of the Swedish punk-reggae band Dag Vag. <a href=\"https://www.last.fm/music/Lykke+Li\">Read more on Last.fm</a>"
    },
    "AVABEREE": {
        "listeners": 3248,
        "bio_summary": "Aimee, Genevieve and Irena are the heart and soul of Avaberée. Three young and dynamic Brisbane 16 year olds with a love for harmonies have collaborated to create tunes for your listening pleasure. Not only will their music make you wish that you never quit the recorder in primary school, it will get your fingers clicking.\n\nThe three Year 12 students have been working on their craft for most of their lives and are accomplished individual performers who have participated in countless singing, music, instrumental and choral concerts. <a href=\"https://www.last.fm/music/Avaberee\">Read more on Last.fm</a>"
    },
    "Icona Pop": {
        "listeners": 1286447,
        "bio_summary": "Icona Pop are a Swedish duo who were formed in 2009, with electro house, punk and indie pop music influences. The two members, Caroline Hjelt and Aino Jawo, who grew up in Stockholm, Sweden, wanted to create music \"which you can both laugh and cry with at the same time\". They signed to TEN Music Group in 2009.\n\nIn late 2010, their song \"Manners\" was featured on Kitsuné Maison Compilation 10. \"Manners\" was later released as their debut single in 2011. <a href=\"https://www.last.fm/music/Icona+Pop\">Read more on Last.fm</a>"
    },
    "First Aid Kit": {
        "listeners": 903034,
        "bio_summary": "There are three bands called First Aid Kit:\n\n1. Swedish indie/folk duo which consists of sisters Johanna (b. 31 October 1990) and Klara Söderberg (b. 8 January 1993) both from Enskede, Sweden. \nThe sisters began composing songs in 2007, taking their name at random from an English dictionary. \nThey began uploading their music to their My Space page and sending their songs to Swedish radio station, this led to live performances and offers from Record Companies. <a href=\"https://www.last.fm/music/First+Aid+Kit\">Read more on Last.fm</a>"
    },
    "Aurora": {
        "listeners": 1141268,
        "bio_summary": "There are numerous artists who have performed under the name Aurora:\n\n1) Aurora Aksnes (born 15 June 1996), known mononymously as AURORA, is a Norwegian singer, songwriter, and record producer. Born in Stavanger, Aurora released her debut extended play, Running With The Wolves, in 2015, through Decca Records. Later the same year, she provided the backing track for the John Lewis Christmas advert, singing a cover of the Oasis song ‘Half The World Away’. <a href=\"https://www.last.fm/music/Aurora\">Read more on Last.fm</a>"
    },
    "KARPE": {
        "listeners": 31309,
        "bio_summary": "Karpe Diem is a Norwegian hip-hop duo consisting of Magdi Omar Ytreeide Abdelmaguid (aka. Magdi) and Chirag Rashmikant Patel (aka. Chicosepoy or Chico). Magdi is half egyptian and half Norwegian, while Chirag is all Indian.\n\nThey formed in 2000 in Oslo, Norway and released their first EP in 2004, Glasskår. They later released their first full-lenght album titled Rett fra hjertet in 2006.\n\nKarpe Diem was established when the two wanted to enter a music competition <a href=\"https://www.last.fm/music/KarPe\">Read more on Last.fm</a>"
    },
    "Todd Terje": {
        "listeners": 417203,
        "bio_summary": "Following a string of celebrated releases leaning on everything from kitschy euro sounds to deep funk and latin jazz, the relatively new to the scene Todd Terje has already made his mark within dance music circuits. Gems such as \"Eurodans\" and the latin disco-fuelled edit of Jacko's \"Can't Help it\" under his Tangoterje edit-moniker instantly made industry types and clubbers alike go bananas, and whatever the 25 year old Norwegian puts his fingers on, it always comes out with that crucial blend of musicality and playfulness.  <a href=\"https://www.last.fm/music/Todd+Terje\">Read more on Last.fm</a>"
    },
    "Lukas Graham": {
        "listeners": 810766,
        "bio_summary": "Lukas Graham is a Danish pop band consisting of vocalist Lukas Graham Forchhammer (born September 18, 1988), drummer Mark \"Lovestick\" Falgren (born November 28, 1988), bassist Magnus Larsson (born September 9, 1990) and keyboardist Kasper Daugaard (born June 14, 1989). \n\nLaunching their debut album in 2012 on Copenhagen Records, Lukas Graham quickly became a popular live act in Denmark. That success translated to the rest of Europe and caught the attention of Warner Bros. <a href=\"https://www.last.fm/music/Lukas+Graham\">Read more on Last.fm</a>"
    },
    "Tove Lo": {
        "listeners": 1651336,
        "bio_summary": "Ebba Tove Elsa Nilsson, known professionally as Tove Lo, is a Swedish singer and songwriter. She is known for her raw, grunge-influenced take on pop music. Her honest, complex and autobiographical lyrical content has led to her being dubbed \"the saddest girl in Sweden\".\n\nRaised in the Djursholm district of Danderyd, Lo is an alumna of the music school Rytmus Musikergymnasiet. She formed the rock band Tremblebee in 2006. After it disbanded, Lo pursued a career in songwriting and earned a publishing deal with Warner/Chappell Music in 2011. <a href=\"https://www.last.fm/music/Tove+Lo\">Read more on Last.fm</a>"
    },
    "Emilie Nicolas": {
        "listeners": 83025,
        "bio_summary": "Over the course of one year Emilie Nicolas has progressed from the status of unknown music student to being widely recognized as one of the most highly anticipated  Scandinavian artists out there.… and this has all been achieved without even releasing a debut album as yet…\n\nIt all started when the 26 year old from the suburbs of Oslo, Norway shared a handful of her independently produced songs on the distribution website Soundcloud in the spring of 2013. <a href=\"https://www.last.fm/music/Emilie+Nicolas\">Read more on Last.fm</a>"
    },
    "Vigiland": {
        "listeners": 245505,
        "bio_summary": "Vigiland is a Swedish DJ/music producing house music duo, made up of Claes Remmered Persson and Otto Pettersson. They became famous with the single \"UFO\" which is in the style of Melbourne Bounce, a slightly more hip hop and sharper variant of progressive house music. <a href=\"https://www.last.fm/music/Vigiland\">Read more on Last.fm</a>"
    },
    "Alesso": {
        "listeners": 1094620,
        "bio_summary": "Alessandro Renato Rodolfo Lindblad, professionally known as Alesso, is a Swedish DJ and record producer.\n\nHe has performed at numerous music festivals, including Coachella, Electric Daisy Carnival, Creamfields and Tomorrowland. In 2012, MTV named Alesso one of the \"EDM Rookies to Watch\".\n\nHe was ranked 13th on DJ Magazine's 2015 list of the top 100 DJs and number 20th in year 2016 on DJ Magazine among the list of Top 100 DJs in the world. His debut full-length album Forever was released on May 22, 2015 by Def Jam Recordings. <a href=\"https://www.last.fm/music/Alesso\">Read more on Last.fm</a>"
    },
    "Alan Walker": {
        "listeners": 1097116,
        "bio_summary": "Alan Olav Walker is a British-Norwegian record producer and DJ. He started as a bedroom producer, taking inspiration from EDM producers K-391 and Ahrix, along with film composers Hans Zimmer and Steve Jablonsky. He was better known as DJ Walkzz before signing a deal with the record label NoCopyrightSounds and releasing his hit debut single \"Fade\" in 2014, followed by \"Spectre\" and \"Force\" the following year. \n\nIn the aforementioned year - 2015 - Walker released his most well-known single \"Faded\" <a href=\"https://www.last.fm/music/Alan+Walker\">Read more on Last.fm</a>"
    },
    "Kygo": {
        "listeners": 1432953,
        "bio_summary": "Kyrre Gørvell-Dahll (born 1991), commonly known by his stage name Kygo, is a Norwegian musician and remixer. He has collaborated with artists such as Selena Gomez, Ellie Goulding and Imagine Dragons, and remixed tracks by the likes of Whitney Houston, Ed Sheeran, and Coldplay. Kygo's videos have been viewed over 3 billion times on YouTube.\n\nKygo started to learn to play the piano at age six through lessons. He decided to have a go at remixes and creating electronic music after discovering Avicii at age 15-16. <a href=\"https://www.last.fm/music/Kygo\">Read more on Last.fm</a>"
    },
    "Marcus & Martinus": {
        "listeners": 0,
        "bio_summary": " <a href=\"https://www.last.fm/music/Marcus+\">Read more on Last.fm</a>"
    },
    "Ina Wroldsen": {
        "listeners": 123285,
        "bio_summary": "Ina Wroldsen (born May 28, 1984) is a Norwegian songwriter. She's also half of the electropop duo Ask Embla, with fellow Icelandic producer and songwriter Arnthor Birgisson. Wroldsen's career started solely as a recording artist, but soon turned to writing music for others. As a songwriter, she has had great success and is internationally considered one of the most sought after in her field. She has won several BMI/ASCAP awards for her work, among BRIT award and Spellemannprisen nominations. <a href=\"https://www.last.fm/music/Ina+Wroldsen\">Read more on Last.fm</a>"
    },
    "Julie Bergan": {
        "listeners": 119180,
        "bio_summary": "Julie Bergan is a Norwegian singer/songwriter. In early 2014, she released her first single  \"Younger\".\n\nBergan has already managed to achieve more than 100 million streams in her career. Doors began opening for real when she released her smash hit ”All hours” October 2015, followed by ”I Kinda Like It”, February 2016. The success continued and she reached an impressive peak later in 2016, when she climbed all the way to the top of the Norwegian charts with the #1 banger ”Arigato”. <a href=\"https://www.last.fm/music/Julie+Bergan\">Read more on Last.fm</a>"
    },
    "Alphabeat": {
        "listeners": 520427,
        "bio_summary": "Alphabeat is a pop band from Silkeborg, Denmark signed to Polydor. The band were previously named Sodastar but this was changed to avoid confusion with a German band. \n\nTheir Danish debut single Fascination was a major hit in Denmark during the summer of 2007. A second single 10,000 Nights saw equal success, just like their eponymous debut album that went platinum in Denmark.\n\nTheir sound is mainly retro 80s melodic pop, taking inspiration amongst others from Deacon Blue and Prefab Sprout, with distinctive overlay of male and female harmonies. <a href=\"https://www.last.fm/music/Alphabeat\">Read more on Last.fm</a>"
    },
    "Axwell": {
        "listeners": 558864,
        "bio_summary": "Axwell, along with Sebastian Ingrosso, and Steve Angello is one-third of of what has become known as the Swedish House Mafia.\n\nAxwell, born Axel Hedfors in the Swedish countryside, found that music was in his system from a tender age. Playing the drums at the age of 9, he became frustrated with his fellow classmates who could not keep up; he traded his drums at the age of 13 for a computer so he could play all the instruments himself. \n\nAxwell released <a href=\"https://www.last.fm/music/Axwell\">Read more on Last.fm</a>"
    },
    "Matoma": {
        "listeners": 478034,
        "bio_summary": "Tom Stræte Lagergren, professionally known as Matoma, is a Norwegian DJ and record producer. Lagergren was born in Åsnes, Norway. He started playing the piano as a child. During that period, he won a contest to perform alongside Norwegian pianists Håvard Gimse and Leif Ove Andsnes. As he grew tired of classical piano, Lagergren began mixing on his computer. He holds a bachelor's degree in Music Technology from the Norwegian University of Science and Technology. <a href=\"https://www.last.fm/music/MATOMA\">Read more on Last.fm</a>"
    },
    "Lido": {
        "listeners": 107742,
        "bio_summary": "Lido, aka Peder Losnegård, is 26 years old and hyperactive. This composer, producer, multi-instrumentalist and drummer since the age of two made a name for himself by posting remixes on SoundCloud (Justin Timberlake, AlunaGeorge, Alt-J, Flight Facilities, Zhu, Mø, Para One and Bill Withers among others).\n\nSome of them have become classics – Lido has notably remixed ‘Often’ by The Weeknd and ‘Latch’ by Disclosure which he did without permission and created a tsunami in the world of EDM <a href=\"https://www.last.fm/music/Lido\">Read more on Last.fm</a>"
    },
    "Boy Pablo": {
        "listeners": 712292,
        "bio_summary": "boy pablo is the indie pop music project of Chilean–Norwegian singer songwriter Nicolas Muñoz. In the recording studio, Muñoz writes, records, performs, and produces all of the project's music. As a touring act, Boy Pablo currently consists of Nicolás Muñoz (guitar, vocals), Gabriel Muñoz (lead guitar), Judah Kubendran (bass guitar) and Esteban Muñoz (drums).\n\nBoy Pablo gained attention in late 2017 after the music video for the song \"Everytime\" gained international popularity on YouTube's algorithm. <a href=\"https://www.last.fm/music/boy+pablo\">Read more on Last.fm</a>"
    },
    "Gabrielle": {
        "listeners": 543229,
        "bio_summary": "There are multiple artists using the name Gabrielle.\n\n1. Louise Gabrielle Bobb (born April 16, 1970, London) is an English singer who records under the name Gabrielle. She has a problem with one eye and in her career, has worn an eyepatch, a long sideswept fringe or more recently (post c. 2000) dark glasses to conceal her eye problem.\nHer debut single \"Dreams\" topped the UK charts in June 1993. A sample of Tracy Chapman's \"Fast Car\" was requested but refused. <a href=\"https://www.last.fm/music/Gabrielle\">Read more on Last.fm</a>"
    },
    "Christopher": {
        "listeners": 208397,
        "bio_summary": "There are several artists who recorded under the name Christopher.\n\n1. Christopher Nissen (born January 31, 1992) is a Danish singer from Copenhagen, signed to EMI Denmark. In November 2012 he won an award at the Danish Music Awards 2012. He was awarded New Thinker of the Year (Årets nytænker), given by Spotify as an innovation prize. His debut single was 'Against the Odds' (September 2011), which reached #23 in Denmark. His début album, 'Colours', was released in March 2012, its follow-up, 'Told You So', in March  2014. <a href=\"https://www.last.fm/music/Christopher\">Read more on Last.fm</a>"
    },
    "Highasakite": {
        "listeners": 166409,
        "bio_summary": "Highasakite is a Norwegian indie-pop band formed in Trondheim in 2011 and consisting of Ingrid Helene Håvik (on vocals), Trond Bersu (drums), Øystein Skar (synths), Marte Eberson (synths) and Kristoffer Lo (guitar, percussion and flugabone). Håvik writes most of the lyrics and music.\n\nHighasaKite make songs unlike most things yet to come out of Norway. Pop music with a twist. Let's start in Brooklyn. Via Monrovia to Piraeus and Norwegian mountaintops on to Stockholm. <a href=\"https://www.last.fm/music/Highasakite\">Read more on Last.fm</a>"
    },
    "Sabina Ddumba": {
        "listeners": 79147,
        "bio_summary": "Sabina Ddumba (born 23 February 1994 in Stockholm, Sweden) is a Ugandan-Swedish singer. Ddumba grew up in Fisksätra, Nacka. Her music has soul, gospel, and R&B influences. Ddumba was a backing vocalist on Katy Perry's song \"Walking on Air\" and has collaborated with artists such as the hip hop band Looptroop Rockers, duo Lorentz & Sakarias and Adam Kanyama. She is signed to Warner Music. Ddumba released her first single, \"Scarred for Life,\" in 2014, and her second single, \"Effortless\" in 2015. <a href=\"https://www.last.fm/music/Sabina+Ddumba\">Read more on Last.fm</a>"
    },
    "Jenny Hval": {
        "listeners": 182201,
        "bio_summary": "Jenny Hval (b. 1980) has in recent years made a name for herself as a writer, journalist, recording artist and sound artist both in Norway and abroad. Her first two albums were released as Rockettothesky. When her third record Viscera was released in 2011, Italian Vogue described her as: “an artist of significant competence, both musically and intellectually.” Multidisciplinary and transgressive are words often employed to describe her art, but Jenny Hval’s polyphonic artistry is in fact seamlessly interwoven between musical <a href=\"https://www.last.fm/music/Jenny+Hval\">Read more on Last.fm</a>"
    },
    "Of Monsters and Men": {
        "listeners": 1816049,
        "bio_summary": "Of Monsters and Men are an indie folk band which formed in 2010 in Keflavík/Garðabær, Iceland. The band consists of Nanna Bryndís Hilmarsdóttir (vocals, guitar), Ragnar Þórhallsson (vocals, guitar), Brynjar Leifsson (guitar), Kristján Páll Kristjánsson (bass), Arnar Rósenkranz Hilmarsson (drums) and the former member  Árni Guðjónsson (keyboards, accordion), who left the band in 2012. The band released their debut album \"My Head Is an Animal\" in September 2011. <a href=\"https://www.last.fm/music/Of+Monsters+and+Men\">Read more on Last.fm</a>"
    },
    "MØ": {
        "listeners": 860438,
        "bio_summary": "\nKaren Marie Ørsted (born August 13 1988), better known by her stage name MØ, is a Danish singer-songwriter.\nBorn in Odense, Denmark, MØ was just seven when the Spice Girls inspired her to make music. In her teenage years, she sang in the punk duo MOR and looked up to Kim Gordon as a \"big hero and role model\". Then in her early twenties, she \"fell in love\" with hip-hop. All of these influences led to her dreamy electro-pop vibe as MØ, which means \"maiden\" or \"virgin\" in Danish. <a href=\"https://www.last.fm/music/+noredirect/M%C3%98\">Read more on Last.fm</a>"
    },
    "Sigrid": {
        "listeners": 508177,
        "bio_summary": "Sigrid Solbakk Raabe (born 5 September 1996), known professionally as Sigrid, is a Norwegian singer and songwriter. In 2017, Sigrid rose to fame with the release of her debut EP Don't Kill My Vibe, and she later won the BBC Music Sound of 2018. Her single \"Strangers\" reached number 10 on the UK Singles Chart, and on 8 March 2019, she released her debut studio album, Sucker Punch, which debuted at number one on Norwegian charts and at number four on the UK Albums Chart. <a href=\"https://www.last.fm/music/Sigrid\">Read more on Last.fm</a>"
    },
    "Lemaitre": {
        "listeners": 122755,
        "bio_summary": "Lemaitre was started in Oslo, Norway in 2010 by Ketil Jansen and Ulrik Denizou Lund. The duo had known each other since they were kids and have both done music in different directions most of their lives. 19 years old and just finished school, they decided to make some music together, Ulrik with background in rock/indie bands and Ketil with background in electronic music. They are influenced by acts such as Daft Punk, Röyksopp, Justice, The Strokes, Ratatat, Phoenix, Noisia and Deadmau5.\n <a href=\"https://www.last.fm/music/+noredirect/Lemaitre\">Read more on Last.fm</a>"
    },
    "Cezinando": {
        "listeners": 31884,
        "bio_summary": "Cezinando is a 25 year old Oslo-based Norwegian Rapper. Cezinando debuted with «Cez 4 Prez» at the age of 16. in 2016, he won the Urørt competition (a competition for indie-up-and-coming-artist) with his single «€PA».\n <a href=\"https://www.last.fm/music/Cezinando\">Read more on Last.fm</a>"
    },
    "Astrid S": {
        "listeners": 499613,
        "bio_summary": "Astrid Smeplass (born 29 October 1996 in Berkåk, Rennebu, Norway), known professionally as Astrid S, is a Norwegian singer, songwriter and model. In 2013, she had her breakthrough when she placed fifth in the Norwegian version of Pop Idol called Idol - Jakten på en superstjerne. \n\nGrowing up in a small town (Berkåk, Norway), Astrid got into music at an early age and at six she started to play the piano. Not long after she was also playing several instruments, in addition to sing and write songs. <a href=\"https://www.last.fm/music/Astrid+S\">Read more on Last.fm</a>"
    },
    "Benny Andersson": {
        "listeners": 77629,
        "bio_summary": "Göran Bror Benny Andersson (born in Stockholm, Sweden on 16 December 1946) is a Swedish musician, composer, a former member of the Swedish musical group ABBA (1972-1982), and co-composer of the musicals Chess, Kristina från Duvemåla, and Mamma Mia!. Currently active with his own band Benny Anderssons Orkester (BAO!), and executive-producing the film version of the musical Mamma Mia!. <a href=\"https://www.last.fm/music/Benny+Andersson\">Read more on Last.fm</a>"
    },
    "TIX": {
        "listeners": 67779,
        "bio_summary": "TIX is a Norwegian singer/songwriter and the biggest producer of \"russemusic\" in Norway. He was raised in Bærum outside of Oslo in Norway and have made multiple of the most streamed songs in Norwegian the last couple of years. \nAndreas Haukeland[1] (born 12 April 1993[2]), most known as Tix (stylized as TIX), is a Norwegian musician, producer and songwriter from Bærum, Norway. He got his breakthrough in 2015 with his \"russ song\" titled \"Sjeiken 2015\". <a href=\"https://www.last.fm/music/Tix\">Read more on Last.fm</a>"
    },
    "Zara Larsson": {
        "listeners": 1148084,
        "bio_summary": "Zara Maria Larsson, a Swedish pop singer, was born on December 16, 1997, in Solna, Stockholm. She rose to fame at the age of 10 when she won the Swedish talent show Talang in 2008. Following her victory, Larsson released her debut single, a cover of \"My Heart Will Go On,\" which achieved chart success in Sweden. She later appeared on the TV program Sommarkrysset and participated in the reality series Jag ska bli stjärna in pursuit of an international music career. <a href=\"https://www.last.fm/music/Zara+Larsson\">Read more on Last.fm</a>"
    }
}